Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/rot.h
/*
 * Component description for ROT
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_ROT_COMPONENT_H_
#define _PIC32WM_BZ6_ROT_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR ROT                       */
/* ************************************************************************** */

/* -------- ROT_SECCFG : (ROT Offset: 0x00) (R/W 32) Secure Configuration HOLDING REGISTER1,2 -------- */
#define ROT_SECCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (ROT_SECCFG) Secure Configuration HOLDING REGISTER1,2  Reset Value */

#define ROT_SECCFG_UUID_LCK_Pos               _UINT32_(4)                                          /* (ROT_SECCFG) Programming lock bits for Unique ID fuses Position */
#define ROT_SECCFG_UUID_LCK_Msk               (_UINT32_(0x3) << ROT_SECCFG_UUID_LCK_Pos)           /* (ROT_SECCFG) Programming lock bits for Unique ID fuses Mask */
#define ROT_SECCFG_UUID_LCK(value)            (ROT_SECCFG_UUID_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_UUID_LCK_Pos)) /* Assignment of value for UUID_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_UUID_LCK_0_Val           _UINT32_(0x0)                                        /* (ROT_SECCFG) Unique ID is not locked  */
#define   ROT_SECCFG_UUID_LCK_1_Val           _UINT32_(0x1)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define   ROT_SECCFG_UUID_LCK_2_Val           _UINT32_(0x2)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define   ROT_SECCFG_UUID_LCK_3_Val           _UINT32_(0x3)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define ROT_SECCFG_UUID_LCK_0                 (ROT_SECCFG_UUID_LCK_0_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is not locked Position */
#define ROT_SECCFG_UUID_LCK_1                 (ROT_SECCFG_UUID_LCK_1_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position */
#define ROT_SECCFG_UUID_LCK_2                 (ROT_SECCFG_UUID_LCK_2_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position */
#define ROT_SECCFG_UUID_LCK_3                 (ROT_SECCFG_UUID_LCK_3_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position */
#define ROT_SECCFG_DEBUG_LCK_Pos              _UINT32_(6)                                          /* (ROT_SECCFG) Lock bits for debug/programming Position */
#define ROT_SECCFG_DEBUG_LCK_Msk              (_UINT32_(0x3) << ROT_SECCFG_DEBUG_LCK_Pos)          /* (ROT_SECCFG) Lock bits for debug/programming Mask */
#define ROT_SECCFG_DEBUG_LCK(value)           (ROT_SECCFG_DEBUG_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_DEBUG_LCK_Pos)) /* Assignment of value for DEBUG_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_DEBUG_LCK_0_Val          _UINT32_(0x0)                                        /* (ROT_SECCFG) Debug is not locked  */
#define   ROT_SECCFG_DEBUG_LCK_1_Val          _UINT32_(0x1)                                        /* (ROT_SECCFG) Debug is locked  */
#define   ROT_SECCFG_DEBUG_LCK_2_Val          _UINT32_(0x2)                                        /* (ROT_SECCFG) Debug is locked  */
#define   ROT_SECCFG_DEBUG_LCK_3_Val          _UINT32_(0x3)                                        /* (ROT_SECCFG) Debug is locked  */
#define ROT_SECCFG_DEBUG_LCK_0                (ROT_SECCFG_DEBUG_LCK_0_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is not locked Position */
#define ROT_SECCFG_DEBUG_LCK_1                (ROT_SECCFG_DEBUG_LCK_1_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position */
#define ROT_SECCFG_DEBUG_LCK_2                (ROT_SECCFG_DEBUG_LCK_2_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position */
#define ROT_SECCFG_DEBUG_LCK_3                (ROT_SECCFG_DEBUG_LCK_3_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position */
#define ROT_SECCFG_ROOT_KEY_LCK_Pos           _UINT32_(8)                                          /* (ROT_SECCFG) Lock bits for storage root Key Position */
#define ROT_SECCFG_ROOT_KEY_LCK_Msk           (_UINT32_(0x3) << ROT_SECCFG_ROOT_KEY_LCK_Pos)       /* (ROT_SECCFG) Lock bits for storage root Key Mask */
#define ROT_SECCFG_ROOT_KEY_LCK(value)        (ROT_SECCFG_ROOT_KEY_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_ROOT_KEY_LCK_Pos)) /* Assignment of value for ROOT_KEY_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_ROOT_KEY_LCK_0_Val       _UINT32_(0x0)                                        /* (ROT_SECCFG) Storage root key is not locked  */
#define   ROT_SECCFG_ROOT_KEY_LCK_1_Val       _UINT32_(0x1)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define   ROT_SECCFG_ROOT_KEY_LCK_2_Val       _UINT32_(0x2)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define   ROT_SECCFG_ROOT_KEY_LCK_3_Val       _UINT32_(0x3)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define ROT_SECCFG_ROOT_KEY_LCK_0             (ROT_SECCFG_ROOT_KEY_LCK_0_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is not locked Position */
#define ROT_SECCFG_ROOT_KEY_LCK_1             (ROT_SECCFG_ROOT_KEY_LCK_1_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position */
#define ROT_SECCFG_ROOT_KEY_LCK_2             (ROT_SECCFG_ROOT_KEY_LCK_2_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position */
#define ROT_SECCFG_ROOT_KEY_LCK_3             (ROT_SECCFG_ROOT_KEY_LCK_3_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position */
#define ROT_SECCFG_BOOT_KEY_LCK_Pos           _UINT32_(10)                                         /* (ROT_SECCFG) Lock bits for Secure Boot/OTA Key Position */
#define ROT_SECCFG_BOOT_KEY_LCK_Msk           (_UINT32_(0x3) << ROT_SECCFG_BOOT_KEY_LCK_Pos)       /* (ROT_SECCFG) Lock bits for Secure Boot/OTA Key Mask */
#define ROT_SECCFG_BOOT_KEY_LCK(value)        (ROT_SECCFG_BOOT_KEY_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_BOOT_KEY_LCK_Pos)) /* Assignment of value for BOOT_KEY_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_BOOT_KEY_LCK_0_Val       _UINT32_(0x0)                                        /* (ROT_SECCFG) Secure boot key is not locked  */
#define   ROT_SECCFG_BOOT_KEY_LCK_1_Val       _UINT32_(0x1)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define   ROT_SECCFG_BOOT_KEY_LCK_2_Val       _UINT32_(0x2)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define   ROT_SECCFG_BOOT_KEY_LCK_3_Val       _UINT32_(0x3)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define ROT_SECCFG_BOOT_KEY_LCK_0             (ROT_SECCFG_BOOT_KEY_LCK_0_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is not locked Position */
#define ROT_SECCFG_BOOT_KEY_LCK_1             (ROT_SECCFG_BOOT_KEY_LCK_1_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position */
#define ROT_SECCFG_BOOT_KEY_LCK_2             (ROT_SECCFG_BOOT_KEY_LCK_2_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position */
#define ROT_SECCFG_BOOT_KEY_LCK_3             (ROT_SECCFG_BOOT_KEY_LCK_3_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position */
#define ROT_SECCFG_PATCH_LCK_Pos              _UINT32_(14)                                         /* (ROT_SECCFG) Lock bits for patch Position */
#define ROT_SECCFG_PATCH_LCK_Msk              (_UINT32_(0x3) << ROT_SECCFG_PATCH_LCK_Pos)          /* (ROT_SECCFG) Lock bits for patch Mask */
#define ROT_SECCFG_PATCH_LCK(value)           (ROT_SECCFG_PATCH_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_PATCH_LCK_Pos)) /* Assignment of value for PATCH_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_PATCH_LCK_0_Val          _UINT32_(0x0)                                        /* (ROT_SECCFG) Patch config and code are not locked  */
#define   ROT_SECCFG_PATCH_LCK_1_Val          _UINT32_(0x1)                                        /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed  */
#define   ROT_SECCFG_PATCH_LCK_2_Val          _UINT32_(0x2)                                        /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed  */
#define   ROT_SECCFG_PATCH_LCK_3_Val          _UINT32_(0x3)                                        /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed  */
#define ROT_SECCFG_PATCH_LCK_0                (ROT_SECCFG_PATCH_LCK_0_Val << ROT_SECCFG_PATCH_LCK_Pos) /* (ROT_SECCFG) Patch config and code are not locked Position */
#define ROT_SECCFG_PATCH_LCK_1                (ROT_SECCFG_PATCH_LCK_1_Val << ROT_SECCFG_PATCH_LCK_Pos) /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed Position */
#define ROT_SECCFG_PATCH_LCK_2                (ROT_SECCFG_PATCH_LCK_2_Val << ROT_SECCFG_PATCH_LCK_Pos) /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed Position */
#define ROT_SECCFG_PATCH_LCK_3                (ROT_SECCFG_PATCH_LCK_3_Val << ROT_SECCFG_PATCH_LCK_Pos) /* (ROT_SECCFG) Patch config and code are locked and cannot be programmed Position */
#define ROT_SECCFG_ADD_BOOT_KEY_Pos           _UINT32_(16)                                         /* (ROT_SECCFG) Additional boot Key bit Position */
#define ROT_SECCFG_ADD_BOOT_KEY_Msk           (_UINT32_(0x1) << ROT_SECCFG_ADD_BOOT_KEY_Pos)       /* (ROT_SECCFG) Additional boot Key bit Mask */
#define ROT_SECCFG_ADD_BOOT_KEY(value)        (ROT_SECCFG_ADD_BOOT_KEY_Msk & (_UINT32_(value) << ROT_SECCFG_ADD_BOOT_KEY_Pos)) /* Assignment of value for ADD_BOOT_KEY in the ROT_SECCFG register */
#define ROT_SECCFG_Msk                        _UINT32_(0x0001CFF0)                                 /* (ROT_SECCFG) Register Mask  */


/* -------- ROT_ANTIROLLBACKCOUNTER : (ROT Offset: 0x04) (R/W 32) Anti Roll back counter -------- */
#define ROT_ANTIROLLBACKCOUNTER_RESETVALUE    _UINT32_(0x00)                                       /*  (ROT_ANTIROLLBACKCOUNTER) Anti Roll back counter  Reset Value */

#define ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER_Pos _UINT32_(0)                                          /* (ROT_ANTIROLLBACKCOUNTER) Anti rollback counter bits Position */
#define ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER_Msk (_UINT32_(0xFF) << ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER_Pos) /* (ROT_ANTIROLLBACKCOUNTER) Anti rollback counter bits Mask */
#define ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER(value) (ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER_Msk & (_UINT32_(value) << ROT_ANTIROLLBACKCOUNTER_ANTIROLLBACKCOUNTER_Pos)) /* Assignment of value for ANTIROLLBACKCOUNTER in the ROT_ANTIROLLBACKCOUNTER register */
#define ROT_ANTIROLLBACKCOUNTER_Msk           _UINT32_(0x000000FF)                                 /* (ROT_ANTIROLLBACKCOUNTER) Register Mask  */


/* -------- ROT_LIFECYCLECTR_BOOTKEY : (ROT Offset: 0x24) (R/W 32) Life cycle counter and Secure boot key LSB bytes -------- */
#define ROT_LIFECYCLECTR_BOOTKEY_RESETVALUE   _UINT32_(0x00)                                       /*  (ROT_LIFECYCLECTR_BOOTKEY) Life cycle counter and Secure boot key LSB bytes  Reset Value */

