Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/rot.h
#define ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER_Pos _UINT32_(0)                                          /* (ROT_LIFECYCLECTR_BOOTKEY) Life cycle counter bits Position */
#define ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER_Msk (_UINT32_(0xF) << ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER_Pos) /* (ROT_LIFECYCLECTR_BOOTKEY) Life cycle counter bits Mask */
#define ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER(value) (ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER_Msk & (_UINT32_(value) << ROT_LIFECYCLECTR_BOOTKEY_LIFECYCLECOUNTER_Pos)) /* Assignment of value for LIFECYCLECOUNTER in the ROT_LIFECYCLECTR_BOOTKEY register */
#define ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2_Pos _UINT32_(16)                                         /* (ROT_LIFECYCLECTR_BOOTKEY) Secure boot key bits Position */
#define ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2_Msk (_UINT32_(0xFFFF) << ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2_Pos) /* (ROT_LIFECYCLECTR_BOOTKEY) Secure boot key bits Mask */
#define ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2(value) (ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2_Msk & (_UINT32_(value) << ROT_LIFECYCLECTR_BOOTKEY_SECUREBOOTKEY_1_2_Pos)) /* Assignment of value for SECUREBOOTKEY_1_2 in the ROT_LIFECYCLECTR_BOOTKEY register */
#define ROT_LIFECYCLECTR_BOOTKEY_Msk          _UINT32_(0xFFFF000F)                                 /* (ROT_LIFECYCLECTR_BOOTKEY) Register Mask  */


/* -------- ROT_SECUREBOOTKEY_3_46 : (ROT Offset: 0x28) (R/W 32) Secure boot key -------- */
#define ROT_SECUREBOOTKEY_3_46_RESETVALUE     _UINT32_(0x00)                                       /*  (ROT_SECUREBOOTKEY_3_46) Secure boot key  Reset Value */

#define ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46_Pos _UINT32_(0)                                          /* (ROT_SECUREBOOTKEY_3_46) Secure boot key bits Position */
#define ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46_Msk (_UINT32_(0xFFFFFFFF) << ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46_Pos) /* (ROT_SECUREBOOTKEY_3_46) Secure boot key bits Mask */
#define ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46(value) (ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46_Msk & (_UINT32_(value) << ROT_SECUREBOOTKEY_3_46_SECUREBOOTKEY_3_46_Pos)) /* Assignment of value for SECUREBOOTKEY_3_46 in the ROT_SECUREBOOTKEY_3_46 register */
#define ROT_SECUREBOOTKEY_3_46_Msk            _UINT32_(0xFFFFFFFF)                                 /* (ROT_SECUREBOOTKEY_3_46) Register Mask  */


/* -------- ROT_SECUREBOOTKEY_47_48_STORAGE_KEY : (ROT Offset: 0x54) (R/W 32) Secure boot key, Storage Key -------- */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_RESETVALUE _UINT32_(0x00)                                       /*  (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Secure boot key, Storage Key  Reset Value */

#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48_Pos _UINT32_(0)                                          /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Secure boot key bits Position */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48_Msk (_UINT32_(0xFFFF) << ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48_Pos) /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Secure boot key bits Mask */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48(value) (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48_Msk & (_UINT32_(value) << ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_SECUREBOOTKEY_47_48_Pos)) /* Assignment of value for SECUREBOOTKEY_47_48 in the ROT_SECUREBOOTKEY_47_48_STORAGE_KEY register */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2_Pos _UINT32_(16)                                         /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Storage root key bits Position */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2_Msk (_UINT32_(0xFFFF) << ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2_Pos) /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Storage root key bits Mask */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2(value) (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2_Msk & (_UINT32_(value) << ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_STORAGE_KEY_1_2_Pos)) /* Assignment of value for STORAGE_KEY_1_2 in the ROT_SECUREBOOTKEY_47_48_STORAGE_KEY register */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_Msk _UINT32_(0xFFFFFFFF)                                 /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Register Mask  */


/* -------- ROT_STORAGE_KEY_3_30 : (ROT Offset: 0x58) (R/W 32) Storage Key -------- */
#define ROT_STORAGE_KEY_3_30_RESETVALUE       _UINT32_(0x00)                                       /*  (ROT_STORAGE_KEY_3_30) Storage Key  Reset Value */

#define ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30_Pos _UINT32_(0)                                          /* (ROT_STORAGE_KEY_3_30) Storage Key bits Position */
#define ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30_Msk (_UINT32_(0xFFFFFFFF) << ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30_Pos) /* (ROT_STORAGE_KEY_3_30) Storage Key bits Mask */
#define ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30(value) (ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30_Msk & (_UINT32_(value) << ROT_STORAGE_KEY_3_30_STORAGE_KEY_3_30_Pos)) /* Assignment of value for STORAGE_KEY_3_30 in the ROT_STORAGE_KEY_3_30 register */
#define ROT_STORAGE_KEY_3_30_Msk              _UINT32_(0xFFFFFFFF)                                 /* (ROT_STORAGE_KEY_3_30) Register Mask  */


/* -------- ROT_STORAGE_KEY_FFCFG : (ROT Offset: 0x74) (R/W 32) Storage Key, FFCFG -------- */
#define ROT_STORAGE_KEY_FFCFG_RESETVALUE      _UINT32_(0x00)                                       /*  (ROT_STORAGE_KEY_FFCFG) Storage Key, FFCFG  Reset Value */

#define ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32_Pos _UINT32_(0)                                          /* (ROT_STORAGE_KEY_FFCFG) Storage Key bits Position */
#define ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32_Msk (_UINT32_(0xFFFF) << ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32_Pos) /* (ROT_STORAGE_KEY_FFCFG) Storage Key bits Mask */
#define ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32(value) (ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32_Msk & (_UINT32_(value) << ROT_STORAGE_KEY_FFCFG_STORAGE_KEY_31_32_Pos)) /* Assignment of value for STORAGE_KEY_31_32 in the ROT_STORAGE_KEY_FFCFG register */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos  _UINT32_(20)                                         /* (ROT_STORAGE_KEY_FFCFG) Device ID bits Position */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Msk  (_UINT32_(0x3) << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Device ID bits Mask */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK(value) (ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Msk & (_UINT32_(value) << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos)) /* Assignment of value for DEV_ID_LCK in the ROT_STORAGE_KEY_FFCFG register */
#define   ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_0_Val _UINT32_(0x0)                                        /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are not locked  */
#define   ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_1_Val _UINT32_(0x1)                                        /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed  */
#define   ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_2_Val _UINT32_(0x2)                                        /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed  */
#define   ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_3_Val _UINT32_(0x3)                                        /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed  */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_0    (ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_0_Val << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are not locked Position */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_1    (ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_1_Val << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_2    (ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_2_Val << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_3    (ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_3_Val << ROT_STORAGE_KEY_FFCFG_DEV_ID_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Device ID fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos _UINT32_(30)                                         /* (ROT_STORAGE_KEY_FFCFG) Die info bits Position */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Msk (_UINT32_(0x3) << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Die info bits Mask */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK(value) (ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Msk & (_UINT32_(value) << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos)) /* Assignment of value for DIE_INFO_LCK in the ROT_STORAGE_KEY_FFCFG register */
#define   ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_0_Val _UINT32_(0x0)                                        /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are not locked  */
#define   ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_1_Val _UINT32_(0x1)                                        /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed  */
#define   ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_2_Val _UINT32_(0x2)                                        /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed  */
#define   ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_3_Val _UINT32_(0x3)                                        /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed  */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_0  (ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_0_Val << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are not locked Position */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_1  (ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_1_Val << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_2  (ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_2_Val << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_3  (ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_3_Val << ROT_STORAGE_KEY_FFCFG_DIE_INFO_LCK_Pos) /* (ROT_STORAGE_KEY_FFCFG) Die information fuses are locked and cannot be programmed Position */
#define ROT_STORAGE_KEY_FFCFG_Msk             _UINT32_(0xC030FFFF)                                 /* (ROT_STORAGE_KEY_FFCFG) Register Mask  */


/* -------- ROT_DEVICE_ID_PATCH_CFG : (ROT Offset: 0x78) (R/W 32) Device ID and Patch CFG -------- */
#define ROT_DEVICE_ID_PATCH_CFG_RESETVALUE    _UINT32_(0x00)                                       /*  (ROT_DEVICE_ID_PATCH_CFG) Device ID and Patch CFG  Reset Value */

#define ROT_DEVICE_ID_PATCH_CFG_VSEL_Pos      _UINT32_(0)                                          /* (ROT_DEVICE_ID_PATCH_CFG) VSEL of device ID Position */
#define ROT_DEVICE_ID_PATCH_CFG_VSEL_Msk      (_UINT32_(0xFF) << ROT_DEVICE_ID_PATCH_CFG_VSEL_Pos) /* (ROT_DEVICE_ID_PATCH_CFG) VSEL of device ID Mask */
#define ROT_DEVICE_ID_PATCH_CFG_VSEL(value)   (ROT_DEVICE_ID_PATCH_CFG_VSEL_Msk & (_UINT32_(value) << ROT_DEVICE_ID_PATCH_CFG_VSEL_Pos)) /* Assignment of value for VSEL in the ROT_DEVICE_ID_PATCH_CFG register */
#define ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB_Pos _UINT32_(16)                                         /* (ROT_DEVICE_ID_PATCH_CFG) Patch CFG-1 lower 16 bits Position */
#define ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB_Msk (_UINT32_(0xFFFF) << ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB_Pos) /* (ROT_DEVICE_ID_PATCH_CFG) Patch CFG-1 lower 16 bits Mask */
#define ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB(value) (ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB_Msk & (_UINT32_(value) << ROT_DEVICE_ID_PATCH_CFG_PATCH_CFG1_LB_Pos)) /* Assignment of value for PATCH_CFG1_LB in the ROT_DEVICE_ID_PATCH_CFG register */
#define ROT_DEVICE_ID_PATCH_CFG_Msk           _UINT32_(0xFFFF00FF)                                 /* (ROT_DEVICE_ID_PATCH_CFG) Register Mask  */


/* -------- ROT_PATCH_CFG : (ROT Offset: 0x7C) (R/W 32) Patch CFG -------- */
#define ROT_PATCH_CFG_RESETVALUE              _UINT32_(0x00)                                       /*  (ROT_PATCH_CFG) Patch CFG  Reset Value */

#define ROT_PATCH_CFG_PATCH_CFG1_HB_Pos       _UINT32_(0)                                          /* (ROT_PATCH_CFG) Patch CFG-1 higher 8 bits Position */
#define ROT_PATCH_CFG_PATCH_CFG1_HB_Msk       (_UINT32_(0xFF) << ROT_PATCH_CFG_PATCH_CFG1_HB_Pos)  /* (ROT_PATCH_CFG) Patch CFG-1 higher 8 bits Mask */
#define ROT_PATCH_CFG_PATCH_CFG1_HB(value)    (ROT_PATCH_CFG_PATCH_CFG1_HB_Msk & (_UINT32_(value) << ROT_PATCH_CFG_PATCH_CFG1_HB_Pos)) /* Assignment of value for PATCH_CFG1_HB in the ROT_PATCH_CFG register */
#define ROT_PATCH_CFG_PATCH_CFG2_Pos          _UINT32_(8)                                          /* (ROT_PATCH_CFG) Patch CFG-2 bits Position */
#define ROT_PATCH_CFG_PATCH_CFG2_Msk          (_UINT32_(0xFFFFFF) << ROT_PATCH_CFG_PATCH_CFG2_Pos) /* (ROT_PATCH_CFG) Patch CFG-2 bits Mask */
#define ROT_PATCH_CFG_PATCH_CFG2(value)       (ROT_PATCH_CFG_PATCH_CFG2_Msk & (_UINT32_(value) << ROT_PATCH_CFG_PATCH_CFG2_Pos)) /* Assignment of value for PATCH_CFG2 in the ROT_PATCH_CFG register */
#define ROT_PATCH_CFG_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ROT_PATCH_CFG) Register Mask  */


